import { defineI18nLocale } from false;
export default defineI18nLocale(() => ({
  layout: {
    ads: {
      error: "الرجاء دعمنا عن طريق تعطيل مانع الإعلانات الخاص بك."
    }
  },
  component: {
    searchBar: {
      search: "إبحث",
      sortBy: "الفرز حسب",
      searchPresence: "البحث على presence",
      sort: {
        mostUsed: "الأكثر إستخدامًا",
        alphabetical: "مرتب حسب الحروف الأبجدية"
      },
      categories: {
        all: "الكل",
        anime: "أنمي",
        games: "ألعاب",
        music: "موسيقى",
        other: "آخر",
        socials: "التـواصل",
        videos: "فيديوات"
      }
    },
    browserCard: {
      wip: "قيد التنفيذ",
      support: {
        safari: "نحن نعمل حاليًا على دعم سفاري، ترقبوا!"
      }
    },
    userChip: {
      loading: "يتم التحميل..."
    },
    storeCard: {
      addPresence: "إضافة",
      removePresence: "إزالة"
    },
    donationModal: {
      title: "خدمة سريعة...",
      description: "نأمل أن تحب بريميد! إذا كانت سببًا برسم البسمة على وجهك، فلماذا لا نتبادل بعض الحب؟ يبذل فريق المتطوعين لدينا قلوبهم ليجعلوه رائعًا لك فقط!",
      continue: "متابعة",
      close: "غلق",
      patreon: "الدعم على {name}",
      github: "الراعي على {name}",
      holdTight: "إنتظر قليلًا... جاري تحميل الزر السحري..."
    }
  },
  header: {
    links: {
      contributors: "المساهمون",
      downloads: "تحميل",
      features: "الميزات",
      store: "المتجر"
    }
  },
  page: {
    users: {
      userPage: {
        title: "مساهمات الحضور",
        error: {
          title: "خطأ",
          description: "نحن نواجه مشكلة في تحميل هذا المستخدم... الرجاء المحاولة مرة أخرى لاحقًا."
        }
      }
    },
    home: {
      meta: {
        title: "الصفحة الرئيسية"
      },
      title: "عزز حضورك على الإنترنت مع بريميد",
      subtitle: "أظهر لأصدقائك ما تستمتع به {word}.",
      words: {
        music: "موسيقى",
        videos: "فيديوهات",
        streams: "البث",
        media: "الوسائط"
      },
      description: "بريميد هي أداة بسيطة وقوية تسمح لك بمشاركة نشاطك الإعلامي الحالي عبر منصات متعددة مثل يوتيوب، وديزني+، ونيتفليكس، وغيرها. ابقى على اتصال واسمح لأصدقائك بمعرفة ما أنت عليه في الوقت الحقيقي.",
      getStarted: "إبدء الان",
      sections: {
        feature: {
          title: "لماذا ستحب PreMiD",
          feature1: {
            title: "التحكم في الخصوصية",
            description: "تحمل المسؤولية عن إعدادات الخصوصية الخاصة بك وتحديد الأنشطة التي تشاركها مع الآخرين. بياناتك، قواعدك."
          },
          feature2: {
            title: "تحريك المجتمع",
            description: "تجرِبة دعم لا مثيل لها لعدد كبير من المنصات المدعومة بمجتمع عاطفي ومتفاني."
          },
          feature3: {
            title: "الإعدادات القابلة للتخصيص",
            description: "."
          },
          feature4: {
            title: "الإعداد السهل",
            description: "إبدأ بتشغيل بريميد في وقت قصير, تضمن عملية الإعداد البسيطة لدينا بداية خالية من المتاعب."
          },
          feature5: {
            title: "متوافق مع شروط خدمة ديسكورد",
            description: "الامتثال التام لشروط خدمة ديسكورد باستخدام نِقَاط النهاية الرسمية التي يوفرها ديسكورد."
          },
          feature6: {
            title: "الميزات المستقبلية",
            description: "ترقب الميزات والتحسينات الجديدة والمثيرة التي ستعزز من تجربة بريميد الخاصة بك بشكل أكبر."
          }
        },
        howItWorks: {
          title: "كيف تعمل",
          step1: {
            title: "تثبيت الملحق",
            description: "أضف بريميد إلى المتصفح الخاص بك."
          },
          step2: {
            title: "تسجيل الدخول باستخدام ديسكورد",
            description: "اربط بريميد بحساب ديسكورد الخاص بك."
          },
          step3: {
            title: "إضافة خدمة",
            description: "اختر الخِدمَات التي تريد عرضها، مثل يوتيوب، وديزني+، والمزيد."
          },
          step4: {
            title: "إستمتع",
            description: "شارك نشاطك واستمتع باستخدام بريميد."
          }
        },
        callToAction: {
          title: "هل أنت مستعد للبدء ؟",
          description: "انضم إلى المستخدمين {count} الذين يحبون بريميد.",
          button: "ابدأ الآن"
        }
      }
    },
    contributors: {
      title: "المساهمون",
      presenceDevelopers: "المطورين الحاضرين",
      staff: "الطاقم",
      supporters: "الداعمين",
      translators: "المترجمين",
      avatar: {
        tooltip: "انقر لنسخ الصورة الرمزية {name}"
      }
    },
    downloads: {
      title: "تحميل",
      steps: {
        install: "تثبيت الملحق",
        login: "تسجيل الدخول باستخدام ديسكورد",
        add: "اضافة تفضيلات",
        showoff: "العرض متوقف!"
      },
      section: {
        heading: {
          title: "حان الوقت الإظهار.",
          description: "استخدم PreMiD الآن وأظهر لأصدقائك ما تفعله ، ربما تجد شخصًا لديه نفس الاهتمامات.",
          getStarted: "إبدء الان",
          extension: "الملحق"
        }
      },
      browser: {
        your: "المتصفح الخاص بك",
        other: "متصفحات أخرى",
        based: "قائم على {browser}"
      },
      mobile: {
        title: "أخبار سيئة!",
        description: "عذراً! بريميد غير متوفر للأجهزة المحمولة!"
      },
      alphaAccess: {
        title: "فتح وصول ألفا الحصري!",
        description: "ادخل إلى مستقبل بريميد من خلال أن تصبح راعيًا لنا أو ترعانا على جيتهوب. دعمك لا يدفع تطويرنا فحسب، بل يمنحك أيضًا حق الوصول الأول إلى أكثر الميزات إبتكارًا التي نصنعها. جرب أحدث ما يمكن أن يقدمه بريميد وأثّر على مساره بملاحظاتك. الأمر لا يتعلق فقط بأن تكون الأول، بل يتعلق بأن تكون جزءًا من شيء أكبر.",
        callToAction: "تعرف على المزيد وانضم إلى الابتكار"
      },
      faq: "الأسئلة الشائعة",
      faqs: {
        q1: {
          question: "ما هو بريميد؟",
          answer: "بريميد هي أداة بسيطة وقابلة للتكوين تتيح لك عرض ما تفعله على الويب في حالة نشاطك على ديسكورد."
        },
        q2: {
          question: "كيف يمكنني استخدام بريميد؟",
          answer: "يمكنك استخدام بريميد عن طريق تثبيت الملحق وتسجيل الدخول باستخدام حساب الديسكورد الخاص بك. بمجرد تسجيل الدخول، يمكنك إضافة وجود إلى ملفك الشخصي والتفاخر بها أمام أصدقائك."
        },
        q3: {
          question: "هل بريميد مخالف لشروط خدمة ديسكورد؟",
          answer: "لا بريميد لا يتعارض مع شروط خدمة ديسكورد. يستخدم بريميد واجهة برمجة تطبيقات ديسكورد (API) (بما في ذلك نِقَاط نهاية واجهة برمجة التطبيقات (API) المُدارة التي يوفرها ديسكورد) لتعيين نشاطك. هذا يعني أن بريميد متوافق تمامًا مع شروط خدمة ديسكورد."
        },
        q4: {
          question: "ما هي الخدمات التي تدعمها بريميد؟",
          answer: "بريميد يدعم العديد من الخدمات المختلفة بما في ذلك يوتيوب، وتويتش، ونيتفليكس. قائمة الخدمات المدعومة آخذة في التزايد باستمرار. يمكنك مشاهدة القائمة الكاملة للوجود على صفحة متجرنا."
        },
        q5: {
          question: "كيف يمكنني المساهمة في بريميد؟",
          answer: "يمكنك المساهمة في بريميد بالانضمام إلى مجتمعنا على GitHub. يمكنك المساعدة من خلال الإبلاغ عن المشكلات، أو اقتراح الميزات، أو المساهمة في التعليمات البرمجية."
        },
        q6: {
          question: "هل بريميد مجاني للإستخدام؟",
          answer: "نعم، بريميد مجاني للاستخدام. ومع ذلك، نحن نقبل التبرعات من خلال باتريون ورعاة GitHub للمساعدة في تطوير المشروع."
        },
        q7: {
          question: "ماذا يجب أن أفعل إذا واجهت مشكلة مع بريميد؟",
          answer: "إذا واجهت أي مشاكل مع بريميد، يمكنك الانضمام إلى خادم ديسكورد الخاص بنا للحصول على الدعم. لدينا أيضًا دليل استكشاف الأخطاء في وثائقنا."
        },
        q8: {
          question: "بريميد لا يدعم xyz، هل يمكنكم إضافته؟",
          answer: "إن ما يسمى بحضورنا هو قائم من قِبَل المجتمع، وليس لدينا الموارد اللازمة لإضافة كل منصة على حدة، مع ذلك، يمكنك إضافة حضورك الخاص باتباع التعليمات الواردة في وثائقنا."
        },
        q9: {
          question: "كم مرة يتم تحديث بريميد؟",
          answer: "نحن مشروع صغير يقوده المتطوعون، ونهدف إلى تحديث بريميد بقدر الإمكان، ولكن لا يمكننا أن نعد بأننا سنكون دائما على اطلاع دائم بالأمور."
        }
      }
    },
    store: {
      title: "المتجر",
      noPresence: "لا يوجد حضور يطابق بحثك...",
      presence: {
        button: {
          reportIssue: "الإبلاغ عن مشكلة",
          suggestFeature: "اقتراح ميزة",
          viewCode: "اعرض الرمز"
        },
        title: {
          description: "الوصف",
          information: "معلومات"
        },
        informationSection: {
          contributors: "المساهمون:",
          version: "الإصدار {version}",
          users: "المستخدمون: {users}",
          tags: "الوسوم:",
          supportedUrls: "عناوين URL المدعومة:"
        }
      },
      header: {
        categories: "الفئات",
        search: "البحث على presence"
      }
    }
  },
  footer: {
    partners: "الشركاء",
    followUs: "تابعنا",
    supportUs: "ادعمنا",
    more: "المزيد",
    legal: "الحقوق",
    supportList: {
      donate: "التبرع",
      contribute: "ساهم",
      translate: "الترجمة"
    },
    moreList: {
      faq: "الأسئلة الأكثر شيوعًا",
      documentation: "الوثائق",
      status: "الحالة"
    },
    legalList: {
      privacyPolicy: "سياسة الخصوصية",
      termsOfService: "شروط الخدمة",
      cookiePolicy: "سياسة ملفات تعريف الإرتباط"
    },
    withLoveBy: "مع",
    by: "بواسطة",
    copyright: "©️ {year}-{currentYear} {company} جميع الحقوق محفوظة."
  },
  error: {
    404: {
      title: false,
      message: "الصفحة التي تبحث عنها غير موجودة."
    },
    500: {
      title: false,
      message: "حدث خطأ ما في نهايتنا."
    },
    default: {
      title: "خطأ",
      message: "حدث خطأ ما في نهايتنا.",
      button: "العودة"
    }
  }
}));