import { defineI18nLocale } from false;
export default defineI18nLocale(() => ({
  layout: {
    ads: {
      error: "Будь ласка, підтримайте нас, вимкнувши блокувальник реклами."
    }
  },
  component: {
    searchBar: {
      search: "Пошук",
      sortBy: "Упорядкувати за",
      searchPresence: "Шукати Presence",
      sort: {
        mostUsed: "Найбільш використовувані",
        alphabetical: "В алфавітному порядку"
      },
      categories: {
        all: "Усе",
        anime: "Аніме",
        games: "Ігри",
        music: "Музика",
        other: "Інше",
        socials: "Соц. мережі",
        videos: "Відео і прямі трансляції"
      }
    },
    browserCard: {
      wip: "Триває виконання",
      support: {
        safari: "Ми працюємо над тим, щоб підтримувати Safari, слідкуйте за оновленнями!"
      }
    },
    userChip: {
      loading: "Завантаження..."
    },
    storeCard: {
      addPresence: "Додати",
      removePresence: "Видалити"
    },
    donationModal: {
      title: "Швидка послуга...",
      description: "Сподіваємося, вам сподобається PreMiD! Якщо він викликає посмішку на вашому обличчі, чому б не поділитися з нами любов'ю у відповідь? Наша команда волонтерів докладає всіх зусиль, щоб зробити його чудовим саме для вас!",
      continue: "Продовжити",
      close: "Закрити",
      patreon: "Підтримати на {name}",
      github: "Стати спонсором на {name}",
      holdTight: "Тримайтесь... завантаження чарівної кнопки..."
    }
  },
  header: {
    links: {
      contributors: "Учасники проєкту",
      downloads: "Завантаження",
      features: "Особливості",
      store: "Магазин"
    }
  },
  page: {
    users: {
      userPage: {
        title: "Внески присутності",
        error: {
          title: "Помилка",
          description: "Не вдається завантажити користувача... Будь ласка, спробуйте ще раз пізніше."
        }
      }
    },
    home: {
      meta: {
        title: "Домашній екран"
      },
      title: "Розширте вашу онлайн присутність у PreMiD",
      subtitle: "Покажіть своїм друзям, який {word} вам подобається.",
      words: {
        music: "Музика",
        videos: "Відео",
        streams: "Трансляції",
        media: "Медіа"
      },
      description: "PreMiD — це простий, але потужний інструмент, який дозволяє вам ділитися своєю поточною медіаактивністю на кількох платформах, таких як YouTube, Disney+, Netflix тощо. Залишайтеся на зв’язку та дозвольте своїм друзям бачити, чим ви займаєтесь, у режимі реального часу.",
      getStarted: "Розпочати",
      sections: {
        feature: {
          title: "Чому тобі сподобається PreMID",
          feature1: {
            title: "Управління конфіденційністю",
            description: "Керуйте налаштуваннями конфіденційності та вирішуйте, якими діями ділитися з іншими. Ваші дані, ваші правила."
          },
          feature2: {
            title: "Керується спільнотою",
            description: "Отримайте безпрецедентну підтримку для безлічі платформ від захопленої та відданої спільноти."
          },
          feature3: {
            title: "Настроювані налаштування",
            description: "Налаштуйте PreMiD відповідно до своїх уподобань та потреб за допомогою широких можливостей персоналізації."
          },
          feature4: {
            title: "Просте Налаштування",
            description: "Почніть працювати з PreMiD в найкоротші терміни. Наш простий процес налаштування гарантує безпроблемний старт."
          },
          feature5: {
            title: " ",
            description: "te\n"
          },
          feature6: {
            title: "Заплановані функції",
            description: " "
          }
        },
        howItWorks: {
          title: "Як це працює?",
          step1: {
            title: "Встанови розширення",
            description: "Додай PreMiD до свого браузера"
          },
          step2: {
            title: "Увійди через Discord",
            description: "Під'єднайте PreMiD до свого облікового запису Discord."
          },
          step3: {
            title: "Додайте сервіси",
            description: "Оберіть сервіси, які ви хочете показувати в статусі, наприклад: Youtube, Disney+ тощо."
          },
          step4: {
            title: "Насолоджуйся",
            description: "Діліться активністю і насолоджуйтесь PreMiD."
          }
        },
        callToAction: {
          title: "Готовий розпочати?",
          description: "Приєднуйся до більше ніж {count} користувачів, які вже полюбили PreMiD",
          button: "Почати зараз"
        }
      }
    },
    contributors: {
      title: "Учасники проєкту",
      presenceDevelopers: "Розробники Presences",
      staff: "Штат",
      supporters: "Прихильники",
      translators: "Перекладачі",
      avatar: {
        tooltip: "Натисніть, щоб скопіювати аватар користувача {name}"
      }
    },
    downloads: {
      title: "Завантаження",
      steps: {
        install: "Встановити розширення",
        login: "Увійди через Discord",
        add: "Додай Presences",
        showoff: "Вразь усіх!"
      },
      section: {
        heading: {
          title: "Час показати.",
          description: "Використовуйте PreMiD зараз і покажіть вашим друзям, що ви робите, мабуть, ви знайдете когось зі схожими інтересами.",
          getStarted: "Розпочати",
          extension: "Розширення"
        }
      },
      browser: {
        your: "Ваш браузер",
        other: "Браузер інших",
        based: false
      },
      mobile: {
        title: "Хм, здається, щось пішло не так!",
        description: "Ой-ой, PreMiD не працює на мобільних!"
      },
      alphaAccess: {
        title: "Розблокуй унікальний доступ до Альфа-версії!",
        description: "Зробіть крок у майбутнє PreMiD, ставши нашим Патроном або підтримавши нас на GitHub. Ваша підтримка не лише прискорює розвиток проєкту, але й дає вам першочерговий доступ до найновіших інноваційних функцій. Випробуйте найсучасніше, що може запропонувати PreMiD, та впливайте на його розвиток своїм зворотним зв’язком. Це не просто про те, щоб бути першим — це про те, щоб стати частиною чогось більшого.",
        callToAction: "Дізнайся більше та приєднуйся до інновацій"
      },
      faq: "ЧаПи",
      faqs: {
        q1: {
          question: "Що таке PreMiD?",
          answer: "PreMiD — це простий і гнучкий інструмент, який дозволяє показувати, що ви робите в інтернеті, у статусі Discord."
        },
        q2: {
          question: "Як використовувати PreMiD?",
          answer: "Ви можете користуватися PreMiD, встановивши розширення та увійшовши через свій обліковий запис Discord. Після входу ви зможете додавати статуси до свого профілю та демонструвати їх друзям."
        },
        q3: {
          question: "Чи суперечить PreMiD правилам користування Discord?",
          answer: "Ні, PreMiD не порушує правила використання Discord. PreMiD користується API Discord (включно з обмеженими ендпоінтами, наданими Discord) для відображення вашої активності. Тобто PreMiD повністю відповідає правилам Discord."
        },
        q4: {
          question: "Які сервіси підтримує PreMiD?",
          answer: "PreMiD підтримує багато різних сервісів, включно з YouTube, Twitch та Netflix. Список підтримуваних сервісів постійно зростає. Повний перелік статусів можна переглянути на нашій сторінці магазину."
        },
        q5: {
          question: "Як я можу допомогти PreMiD?",
          answer: "Ви можете допомогти розвитку PreMiD, приєднавшись до нашої спільноти на GitHub. Ви можете сприяти проєкту, повідомляючи про проблеми, пропонуючи нові функції або додаючи код."
        },
        q6: {
          question: "PreMiD безкоштовний для використання?",
          answer: "Так, PreMiD безкоштовний у використанні. Проте ми приймаємо донати через Patreon та GitHub Sponsors, щоб підтримати розвиток проєкту."
        },
        q7: {
          question: "Що робити, якщо ви зіткнулися з проблемою у PreMiD?",
          answer: "Якщо ви зіткнулися з проблемами у PreMiD, ви можете приєднатися до нашого Discord-серверу для отримання підтримки. Також у нашій документації є посібник із усунення неполадок."
        },
        q8: {
          question: "PreMiD не підтримує xyz. Чи можна це додати?",
          answer: "Наші «Presences» створюються спільнотою, і ми не маємо ресурсів для підтримки всіх платформ. Проте ви можете додати власний статус, дотримуючись інструкцій у нашій документації."
        },
        q9: {
          question: "Як часто PreMiD оновлюється?",
          answer: "Ми — невеликий волонтерський проєкт. Ми намагаємося оновлювати PreMiD якнайчастіше, але не завжди можемо бути на 100% у курсі всього."
        }
      }
    },
    store: {
      title: "Магазин",
      noPresence: "Немає жодного збігу з вашим запитом…",
      presence: {
        button: {
          reportIssue: "Повідомити про проблему",
          suggestFeature: "Запропонувати ідею",
          viewCode: "Побачити код"
        },
        title: {
          description: "Опис",
          information: "Інформація"
        },
        informationSection: {
          contributors: "За підтримки:",
          version: "Версія: {version}",
          users: "Користувачі: {users}",
          tags: "Теги:",
          supportedUrls: "Підтримувані URL-адреси:"
        }
      },
      header: {
        categories: "Категорії",
        search: "Шукати Presence"
      }
    }
  },
  footer: {
    partners: "Партнери",
    followUs: "Слідкуйте за нами",
    supportUs: "Підтримайте нас",
    more: "Більше",
    legal: false,
    supportList: {
      donate: "Пожертвувати",
      contribute: "Зробити внесок",
      translate: "Перекласти"
    },
    moreList: {
      faq: "ЧаПи",
      documentation: "Документація",
      status: "Статус"
    },
    legalList: {
      privacyPolicy: "Політика конфіденційності",
      termsOfService: "Правила користування",
      cookiePolicy: "Політика використання Cookie"
    },
    withLoveBy: "З",
    by: "від",
    copyright: "© {year}-{currentYear} {company} Всі права захищені."
  },
  error: {
    404: {
      title: false,
      message: "Хм, здається, ви забрели не туди."
    },
    500: {
      title: false,
      message: "Ой-ой, у нас щось зламалося!"
    },
    default: {
      title: "Помилка",
      message: "Ой-ой, у нас щось зламалося!",
      button: "Повернутися"
    }
  }
}));